# Дано целое число m, задающее номер месяца года.
# Выведите строку — название времени года, соответствующего данному месяцу.
# Формат входных данных: дано целое число m (1 ≤ m ≤ 12).
# Формат выходных данных: требуется вывести название времени года

# TODO: your code here
m = int(input("введите числовое значение месяца от 1 до 12 включительно: "))
if m == 1:
    print("январь")
if m == 2:
    print("февраль")
if m == 3:
    print("март")
if m == 4:
    print("апрель")
if m == 5:
    print("май")
if m == 6:
    print("июнь")
if m == 7:
    print("июль")
if m == 8:
    print("август")
if m == 8:
    print("сентябрь")
if m == 10:
    print("октябрь")
if m == 11:
    print("ноябрь")
if m == 12:
    print("декабрь")
