# Задача 3. Таблица стоимости
# Одна единица некоторого товара стоит x рублей. Напечатайте таблицу стоимости 2, 3, ..., 20 единиц этого товара.
# Формат входных данных
# Дано одно положительное вещественное число x - цена единицы товара
# Формат выходных данных
# Выведите таблицу стоимости. Цены вывести с точностью до двух знаков

# пример:
# Входные данные
# 9.99
# Выходные данные
# 1 9.99 Rub.
# 2 19.98 Rub.
# 3 29.97 Rub.
# 4 39.96 Rub.
# 5 49.95 Rub.
# 6 59.94 Rub.
# 7 69.93 Rub.
# 8 79.92 Rub.
# 9 89.91 Rub.
# 10 99.9 Rub.
# 11 109.89 Rub.
# 12 119.88 Rub.
# 13 129.87 Rub.
# 14 139.86 Rub.
# 15 149.85 Rub.
# 16 159.84 Rub.
# 17 169.83 Rub.
# 18 179.82 Rub.
# 19 189.81 Rub.
# 20 199.8 Rub.

# TODO: your code here
x = float(input("Введите положительное вещественное число x - цену единицы товара: "))
#for n in range(1, 20):
n = 1
s = float(n * x)
print(n, " ", s, " Rub.")
n = 2
s = float(n * x)
print(n, " ", s, " Rub.")
n = 3
s = float(n * x)
print(n, " ", s, " Rub.")
n = 4
s = float(n * x)
print(n, " ", s, " Rub.")
n = 5
s = float(n * x)
print(n, " ", s, " Rub.")
n = 6
s = float(n * x)
print(n, " ", s, " Rub.")
n = 7
s = float(n * x)
print(n, " ", s, " Rub.")
n = 8
s = float(n * x)
print(n, " ", s, " Rub.")
n = 9
s = float(n * x)
print(n, " ", s, " Rub.")
n = 10
s = float(n * x)
print(n, " ", s, " Rub.")
n = 11
s = float(n * x)
print(n, " ", s, " Rub.")
n = 12
s = float(n * x)
print(n, " ", s, " Rub.")
n = 13
s = float(n * x)
print(n, " ", s, " Rub.")
n = 14
s = float(n * x)
print(n, " ", s, " Rub.")
n = 15
s = float(n * x)
print(n, " ", s, " Rub.")
n = 16
s = float(n * x)
print(n, " ", s, " Rub.")
n = 17
s = float(n * x)
print(n, " ", s, " Rub.")
n = 18
s = float(n * x)
print(n, " ", s, " Rub.")
n = 19
s = float(n * x)
print(n, " ", s, " Rub.")
n = 20
s = float(n * x)
print(n, " ", s, " Rub.")
